/*
・アイテム

レアウンコ
ハエが飛んでる
打てる球の数
相手がウンコするほど自分のサブウンコがたまる
サブウンコ
ウンコ地雷、スローウンコ、チャージウンコ、下痢ウンコ
ためると自爆
スマッシュボール
ルカリオ的な、メガウンコ、消臭スプレーアーマー、ハエ、ウンコアーミー

・ステージ
床にウンコが付着
壊れる足場、すまむら、畑、
機動力、ジャンプ力、攻撃力、弾性力


・キャラクター

name.text = "ウンコボーイ";
special.text = "クッソルケン";
-一番オーソドックスなキャラクター
ジャンプは高く、移動は遅い-

name.text = "ウンコマン";
special.text = "ブリブリアタック";
-ウンコボーイよりは早いが
その分飛距離が低い-

name.text = "ゲーリー";
special.text = "ビックベン";
-早く移動し高く飛ぶが
横には跳べないためカウンターを狙う-

name.text = "ヘーデル";
special.text = "Ｋ２ストライク";
-能力は低めだが
2段ジャンプができる-

name.text = "オベンキー";
special.text = "スクラビングバブル";
-良く跳ねるので
積極的に跳ぼう-

name.text = "ナガシマ＝ショウ";
special.text = "獅子糞迅";
-空中でもわずかに移動ができるので
回避や攻撃に生かせる-

name.text = "フンボルト";
special.text = "フンダートシャイセ";
-弾を上に打つため
下からでも勝てる可能性あり-

name.text = "ウンコスキー";
special.text = "ベンベンポロシャ";
-移動は鈍重だけど
とても重いので跳ぶ隙が少ない-

跳ぶ方向が自由

キャラを光らせる
最初にスピン
キャラの調整

きいろぉぉぉぉぉおおおお！！！！

相手のmxをexとかで保管
自機はismineのmxで動かして
敵はelseからのexで動かす
完璧
1sに一回位置の確認
ジャンプは飛んだときのみ送信
壁ワープは無論実装
あとはハエと着地糞
黄のスカラベ
クッソルケン
ウォシュレト=ベンキスキー
ブリー=フンデルセン
ゲリクソンJr.

ハエは近辺10戦での勝利数に応じて増える
あと着地糞の使いまわし

extribe追記
遠距離トライブ制作
ジャンプ敵追加

カメラ位置→近づけばカメラも近づく
ポーズボタン→中央上
画面が寂しい→文字とか出してみる？、UIは？出せるものがないわ、やっぱ必殺技では？、あとアイテム、よかった、これで解決ですね
ピットストップ→白黒とか赤黒とか、シェーダーで何とかなるかな？
爆発もメリハリを付けよう
それなら発射も…と言ってもこれはどうすればよいやら…
✓キャラより前のレイヤーじゃん
もっとオーラを、あと着地もでかい&地味
？弾を撃ちすぎると小さくなっていく
？おならＳＥから空打ちとか作りたい


まずこのゲームのテーマって何？？
・遊びやすいゲーム
・深みのある駆け引き
・あほみたいなシステム
→なんかとっつきやすそうなデザインが望ましい

タイトル画面
・うんこ跳ねさせる？

キャラ選択
・名前、説明はスライドして出す
・選択されているキャラだけ明るく表示
→少しだけ点灯させる
・選択されているキャラのムービーを表示？
→面倒なのでそれは後回し

戦闘画面
・最初に格ゲーの～～VS～～みたいのを表示
→ドアを左右からガシャン（十戦の戦績とキャラ、名前）→シャッターとドアを同時に開く
・着地エフェクトを改造
・必殺技ゲージを置く
・CPUの挙動を変更
→✓画面端の認識、✓後だしの対応、たまに弾が出ない
・✓爆発エフェクトの変更

CPU改造案
×リソースを３つに分ける
→オーバーライド形式

*/
